package com.myjava01;
/*
    面对对象思想，基于面向过程的编程思想。
    面向过程：强调每一个功能的步骤
    面向对象：强调对象，由对象调用功能；
    特点：
        A：是一种更符合我们思考习惯的思想
        B：可以将复杂的事情简单化
        C：从执行变成指挥
    举例：
        买电脑
            面向过程：我要买电脑，需求；
                       我要明确买电脑的意义
                       上网查对应的参数信息；
                       去中关村买电脑；
                       讨价还价；
                       买回电脑。
           面向对象：我要买电脑，-班长去给我买电脑-买回电脑
       洗衣服：
            面向过程：脱衣服 -盆-洗衣粉-加水-浸泡10分钟-揉衣服-清洗-拧干-晾衣服
            面向对象：脱衣服-打开洗衣机-扔衣服-按钮-晾衣服
 */
public class ObjectDemo {
}
